Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2026 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/obj.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "shared/runtime/mpirq.h"

#include "modmachine.h"
#include "machine_pin.h"
#include "tcpwm.h"

#include "cy_gpio.h"
#include "cy_sysclk.h"
#include "cy_trigmux.h"
#include "cy_tcpwm_counter.h"
#include "cy_tcpwm.h"
#include "clk.h"

#include "genhdr/pins_af.h"
#include "sys_int.h"

// Reuse machine.Pin IRQ API to implement Counter index input callbacks.
extern mp_obj_t machine_pin_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args);

// Forward declaration so init-failure path can reuse deinit logic.
static mp_obj_t machine_counter_deinit(mp_obj_t self_in);

// Number of Counter object slots supported by this port.
#define MACHINE_COUNTER_NUM_INSTANCES  MICROPY_PY_MACHINE_TCPWM0_NUM_COUNTERS
// Shared TCPWM source clock frequency used by Counter.
#define COUNTER_CLK_HZ                 (1000000UL)
// Value used to disable optional TCPWM trigger inputs.
#define COUNTER_INPUT_DISABLED         (0x7U)

typedef enum {
    COUNTER_EDGE_RISING = 1,
    COUNTER_EDGE_FALLING = 2,
} machine_counter_edge_t;

typedef enum {
    COUNTER_DIR_UP = 1,
    COUNTER_DIR_DOWN = 2,
} machine_counter_dir_t;

#define MACHINE_COUNTER_IRQ_RESET      (1U << 0)
#define MACHINE_COUNTER_IRQ_INDEX      (1U << 1)
#define MACHINE_COUNTER_IRQ_MATCH      (1U << 2)
#define MACHINE_COUNTER_IRQ_ROLL_UNDER (1U << 3)
#define MACHINE_COUNTER_IRQ_ROLL_OVER  (1U << 4)
#define MACHINE_COUNTER_ALLOWED_FLAGS  (MACHINE_COUNTER_IRQ_RESET \
    | MACHINE_COUNTER_IRQ_INDEX \
    | MACHINE_COUNTER_IRQ_MATCH \
    | MACHINE_COUNTER_IRQ_ROLL_UNDER \
    | MACHINE_COUNTER_IRQ_ROLL_OVER)

typedef struct _machine_counter_obj_t {
    mp_obj_base_t base;
    uint8_t id;
    uint32_t counter_num;
    en_clk_dst_t pclk_dst;
    pclk_div_obj_t *pclk_div;
    mp_hal_pin_obj_t src_pin;
    mp_hal_pin_obj_t index_pin;
    mp_hal_pin_obj_t reset_pin;
    uint32_t match_value;
    bool match_enabled;
    uint8_t edge;
    uint8_t direction;
    uint32_t range_min;
    uint32_t range_max;
    bool range_min_negative;
    bool range_max_negative;
    uint16_t cycles_u16;
    mp_int_t offset;
    mp_obj_t index_irq_obj;
    mp_obj_t reset_irq_obj;
    mp_irq_obj_t *mp_irq_obj;
    mp_uint_t mp_irq_flags;
    mp_uint_t mp_irq_trigger;
    sys_int_cfg_t irq_cfg;
    bool irq_active;
    bool configured;
} machine_counter_obj_t;

// One Counter object per hardware id.
static machine_counter_obj_t *counter_obj[MACHINE_COUNTER_NUM_INSTANCES] = { NULL };

// ---------------------------------------------------------------------------
// Per-ID hardware mapping from generated AF data.
// ---------------------------------------------------------------------------

// Expands generated map entries into id->hardware-counter lookup.
#define COUNTER_HW_ENTRY(id, counter, irq, pclk, trig) counter,
static const uint32_t counter_hw[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_HW_ENTRY)
};
#undef COUNTER_HW_ENTRY

// Expands generated map entries into id->output-trigger-line lookup.
#define COUNTER_OUT_TRIG_ENTRY(id, counter, irq, pclk, trig) trig,
static const uint32_t counter_out_trig[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_OUT_TRIG_ENTRY)
};
#undef COUNTER_OUT_TRIG_ENTRY

// Expands generated map entries into id->counter-IRQ lookup.
#define COUNTER_IRQ_ENTRY(id, counter, irq, pclk, trig) irq,
static const IRQn_Type counter_irq[MACHINE_COUNTER_NUM_INSTANCES] = {
    MICROPY_PY_MACHINE_TCPWM_MAP(COUNTER_IRQ_ENTRY)
};
#undef COUNTER_IRQ_ENTRY

// ---------------------------------------------------------------------------
// Core Helpers
// ---------------------------------------------------------------------------

// Configure the peripheral clock divider for this Counter instance.
// The Counter base clock is fixed (COUNTER_CLK_HZ), so once a divider has been
// allocated it is reused on subsequent init() calls (no re-init).
static void machine_counter_configure_clock(machine_counter_obj_t *self) {
    if (self->pclk_div != NULL) {
        return;
    }

    machine_tcpwm_slave_init(self->pclk_dst);

    uint32_t clk_freq = pclk_div_get_input_freq(self->pclk_dst);
    if (clk_freq == 0U) {
        mp_raise_ValueError(MP_ERROR_TEXT("failed to get counter input clock"));
    }

    uint32_t divider = (clk_freq / COUNTER_CLK_HZ) - 1U;

    self->pclk_div = pclk_div_init(self->pclk_dst, divider, 0);
    if (self->pclk_div == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("Counter clock dividers exhausted"));
    }
}

// Return the max period for this counter width (16-bit or 32-bit).
static uint32_t machine_counter_period_max(uint32_t counter_num) {
    return (counter_num >= 256U) ? 0xFFFFU : UINT32_MAX;
}

/**
 * TODO:
 * The TrigMux functionality might be required for other modules,
 * and these definitions might be move in the future to a separate
 * c file to be shared by other modules.
 * Only PERI0 is used here, but PERI1 is also available and could
 * be used.
 */
#define MAP_COUNTER_PIN_INPUT_TRIGGER(id) \
    [id] = PERI_0_TRIG_IN_MUX_3_PERI0_HSIOM_TR_OUT##id,

