Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
    mp_hal_pin_af_config_t src_pin_af_config = MP_HAL_PIN_AF_CONF_INIT(src_pin, CY_GPIO_DM_HIGHZ, 0, MACHINE_PIN_AF_SIGNAL_PERI_TR_IO_INPUT);

    machine_pin_af_unit_t fn_unit = MACHINE_PIN_AF_UNIT_NONE;
    mp_hal_periph_pins_af_resolve_fn_unit(&src_pin_af_config, 1, MACHINE_PIN_AF_FN_PERI_TR_IO, &fn_unit);

    en_peri0_trig_input_debugreducation1_t in_trig = peri0_tr_io_input[fn_unit];

    // Ensure the peripheral clock divider is configured and bound to this counter PCLK.
    machine_counter_configure_clock(self);

    // Tear down any previous run before programming new pin routing.
    machine_counter_stop_hw(self);
    machine_counter_stop_irq(self);
    machine_counter_disable_aux_irqs(self);
    machine_counter_restore_src_pin(self);

    mp_hal_periph_pins_af_init(&src_pin_af_config, 1);

    // Record the source pin now so rollback can restore it on any failure below.
    self->src_pin = src_pin;
    self->index_pin = index_pin;
    self->reset_pin = reset_pin;

    // Connect selected pin trigger line to this counter's dedicated trigger input.
    uint32_t out_trig = counter_out_trig[self->id];
    cy_en_trigmux_status_t mux_rslt = Cy_TrigMux_Connect(in_trig, out_trig, false, TRIGGER_TYPE_LEVEL);
    if (mux_rslt != CY_TRIGMUX_SUCCESS) {
        // Roll back pin mux state if trigger connect fails.
        machine_counter_restore_src_pin(self);
        machine_counter_disable_aux_irqs(self);
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter route connect failed (0x%lx)"),
            (unsigned long)mux_rslt);
    }

    bool index_reset_same_pin = (self->index_pin != NULL
        && self->reset_pin != NULL
        && self->index_pin == self->reset_pin);

    if (self->index_pin != NULL) {
        self->index_irq_obj = machine_counter_enable_aux_irq(
            self->index_pin,
            index_reset_same_pin
                ? machine_counter_index_reset_handler_obj[self->id]
                : machine_counter_index_handler_obj[self->id]);
        if (index_reset_same_pin) {
            self->reset_irq_obj = self->index_irq_obj;
        }
    }

    if (self->reset_pin != NULL && !index_reset_same_pin) {
        self->reset_irq_obj = machine_counter_enable_aux_irq(
            self->reset_pin,
            machine_counter_reset_handler_obj[self->id]);
    }

    cy_stc_tcpwm_counter_config_t cfg = {0};
    cfg.period = period;
    cfg.clockPrescaler = CY_TCPWM_COUNTER_PRESCALER_DIVBY_1;
    cfg.runMode = CY_TCPWM_COUNTER_CONTINUOUS;
    cfg.countDirection = CY_TCPWM_COUNTER_COUNT_UP;
    cfg.compareOrCapture = CY_TCPWM_COUNTER_MODE_COMPARE;
    cfg.compare0 = match_value;
    cfg.compare1 = 0;
    cfg.enableCompareSwap = false;
    cfg.interruptSources = CY_TCPWM_INT_ON_TC | (match_enabled ? CY_TCPWM_INT_ON_CC0 : 0U);
    cfg.captureInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.captureInput = CY_TCPWM_INPUT_0;
    cfg.reloadInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.reloadInput = CY_TCPWM_INPUT_0;
    cfg.startInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.startInput = CY_TCPWM_INPUT_0;
    cfg.stopInputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.stopInput = CY_TCPWM_INPUT_0;
    cfg.countInputMode = (edge == COUNTER_EDGE_RISING) ? CY_TCPWM_INPUT_RISINGEDGE : CY_TCPWM_INPUT_FALLINGEDGE;
    // With TCPWM_TR_ONE_CNT_NR == 1 this selects one-to-one trigger input for this counter.
    cfg.countInput = CY_TCPWM_INPUT_TRIG_0;

    #if (CY_IP_MXTCPWM_VERSION >= 2U)
    cfg.capture1InputMode = COUNTER_INPUT_DISABLED & 0x3U;
    cfg.capture1Input = CY_TCPWM_INPUT_0;
    cfg.enableCompare1Swap = false;
    cfg.compare2 = CY_TCPWM_GRP_CNT_CC0_DEFAULT;
    cfg.compare3 = CY_TCPWM_GRP_CNT_CC0_BUFF_DEFAULT;
    cfg.trigger0Event = CY_TCPWM_CNT_TRIGGER_ON_DISABLED;
    cfg.trigger1Event = CY_TCPWM_CNT_TRIGGER_ON_DISABLED;
    #endif

    cy_en_tcpwm_status_t rslt = Cy_TCPWM_Counter_Init(TCPWM0, self->counter_num, &cfg);
    if (rslt != CY_TCPWM_SUCCESS) {
        machine_counter_restore_src_pin(self);
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter(%u) init failed (PDL error 0x%lx)"),
            (unsigned)self->id, (unsigned long)rslt);
    }

    Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
    clear_counter_irqs(self, CY_TCPWM_INT_ON_TC | CY_TCPWM_INT_ON_CC0);

    self->irq_cfg.priority = SYS_INT_IRQ_LOWEST_PRIORITY;
    self->irq_cfg.handler = machine_counter_irq_handlers[self->id];
    sys_int_init(&self->irq_cfg);
    self->irq_active = true;

    Cy_TCPWM_Counter_Enable(TCPWM0, self->counter_num);
    Cy_TCPWM_TriggerReloadOrIndex_Single(TCPWM0, self->counter_num);

    self->edge = edge;
    self->direction = direction;
    self->range_min = range_min;
    self->range_max = range_max;
    self->range_min_negative = (min_value < 0);
    self->range_max_negative = (max_value < 0);
    self->match_enabled = match_enabled;
    self->match_value = match_value;
    self->cycles_u16 = 0;
    self->offset = min;
    machine_counter_apply_interrupt_mask(self);
    self->configured = true;
}

// Wrapper that enforces identical rollback semantics for constructor and init().
static void machine_counter_init_helper(machine_counter_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_counter_init_helper_impl(self, n_args, pos_args, kw_args);
        nlr_pop();
    } else {
        machine_counter_deinit(MP_OBJ_FROM_PTR(self));
        nlr_jump(nl.ret_val);
    }
}

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// Public Lifecycle API
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------

// ---------------------------------------------------------------------------
// Constructor: Counter(id, ...)
// ---------------------------------------------------------------------------
// Create a Counter object, reserve hardware, and run optional init.
static mp_obj_t machine_counter_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {

    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    mp_int_t id = mp_obj_get_int(args[0]);
    if (id < 0 || id >= MACHINE_COUNTER_NUM_INSTANCES) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter id must be in range 0-%d"),
            MACHINE_COUNTER_NUM_INSTANCES - 1);
    }

