Infineon/micropython-psoc-edge/ports/psoc-edge/machine_counter.c
    if (counter_obj[id] != NULL) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("Counter(%u) already created."), (unsigned)id);
    }

    machine_counter_obj_t *self = mp_obj_malloc(machine_counter_obj_t, &machine_counter_type);
    counter_obj[id] = self;

    self->id = (uint8_t)id;
    self->counter_num = counter_hw[id];
    self->pclk_dst = machine_tcpwm_counter_pclk(self->counter_num);
    self->pclk_div = NULL;
    self->src_pin = NULL;
    self->index_pin = NULL;
    self->reset_pin = NULL;
    self->match_value = 0;
    self->match_enabled = false;
    self->edge = COUNTER_EDGE_RISING;
    self->direction = COUNTER_DIR_UP;
    self->range_min = 0;
    self->range_max = machine_counter_period_max(self->counter_num);
    self->range_min_negative = false;
    self->range_max_negative = false;
    self->cycles_u16 = 0;
    self->offset = 0;
    self->index_irq_obj = MP_OBJ_NULL;
    self->reset_irq_obj = MP_OBJ_NULL;
    self->mp_irq_obj = NULL;
    self->mp_irq_flags = 0;
    self->mp_irq_trigger = 0;
    self->irq_cfg.irq_num = counter_irq[id];
    self->irq_active = false;
    self->configured = false;

    nlr_buf_t nl;
    if (nlr_push(&nl) == 0) {
        machine_tcpwm_counter_alloc(self->counter_num, MP_OBJ_FROM_PTR(self));
        nlr_pop();
    } else {
        counter_obj[id] = NULL;
        nlr_jump(nl.ret_val);
    }

    mp_map_t kw_map;
    mp_map_init_fixed_table(&kw_map, n_kw, args + n_args);
    machine_counter_init_helper(self, n_args - 1, args + 1, &kw_map);

    return MP_OBJ_FROM_PTR(self);
}

// ---------------------------------------------------------------------------
// counter.init(src, *, edge=, direction=)
// ---------------------------------------------------------------------------

// Python binding for Counter.init(...).
static mp_obj_t machine_counter_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    machine_counter_init_helper(MP_OBJ_TO_PTR(args[0]), n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_counter_init_obj, 1, machine_counter_init);

// ---------------------------------------------------------------------------
// counter.deinit()
// ---------------------------------------------------------------------------

// Python binding for Counter.deinit().
static mp_obj_t machine_counter_deinit(mp_obj_t self_in) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(self_in);

    // Only touch the TCPWM0 block if this counter actually configured it.
    if (self->pclk_div != NULL) {
        machine_counter_stop_hw(self);
    }
    machine_counter_stop_irq(self);
    machine_counter_disable_aux_irqs(self);
    machine_counter_restore_src_pin(self);

    self->configured = false;
    self->cycles_u16 = 0;
    self->offset = 0;
    self->match_enabled = false;
    self->match_value = 0;
    self->mp_irq_flags = 0;
    self->mp_irq_trigger = 0;
    if (self->mp_irq_obj != NULL) {
        self->mp_irq_obj->handler = mp_const_none;
    }

    if (self->pclk_div != NULL) {
        pclk_div_deinit(self->pclk_div);
        self->pclk_div = NULL;
        // Release the shared TCPWM0 slave
        machine_tcpwm_slave_deinit(self->pclk_dst);
    }

    machine_tcpwm_counter_free(self->counter_num, MP_OBJ_FROM_PTR(self));
    if (counter_obj[self->id] == self) {
        counter_obj[self->id] = NULL;
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_counter_deinit_obj, machine_counter_deinit);

// Module-level lifecycle called from machine_deinit().
void machine_counter_deinit_all(void) {
    for (uint8_t i = 0; i < MACHINE_COUNTER_NUM_INSTANCES; i++) {
        machine_counter_obj_t *self = counter_obj[i];
        if (self != NULL) {
            machine_counter_deinit(MP_OBJ_FROM_PTR(self));
        }
    }
}

// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------
// Public Data/IRQ API
// ---------------------------------------------------------------------------
// ---------------------------------------------------------------------------

// ---------------------------------------------------------------------------
// counter.value([value])
// ---------------------------------------------------------------------------
// Return current count, or reset logical origin when a value is provided.
static mp_obj_t machine_counter_value(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    // Get the span of the counter range.
    uint64_t span = (uint64_t)machine_counter_range_span_value(self);

    // If a value is provided, freeze counting during read/reset
    if (n_args == 2) {
        // Freeze counting during read/reset so no new edges arrive in this window.
        Cy_TCPWM_Counter_Disable(TCPWM0, self->counter_num);
    }

    mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
    uint32_t raw = Cy_TCPWM_Counter_GetCounter(TCPWM0, self->counter_num);
    int16_t cycles = machine_counter_cycles_get(self);
    MICROPY_END_ATOMIC_SECTION(irq_state);

    long long edge_total;
    if (self->direction == COUNTER_DIR_DOWN) {
        edge_total = (long long)(-cycles) * (long long)span + (long long)raw;
        edge_total = -edge_total;
    } else {
        edge_total = (long long)cycles * (long long)span + (long long)raw;
    }
    long long result = (long long)self->offset + edge_total;

    if (n_args == 2) {
        self->offset = mp_obj_get_int(args[1]);
        self->cycles_u16 = 0;
        Cy_TCPWM_Counter_SetCounter(TCPWM0, self->counter_num, 0);
        clear_counter_irqs(self, CY_TCPWM_INT_ON_TC | CY_TCPWM_INT_ON_CC0);
        Cy_TCPWM_Counter_Enable(TCPWM0, self->counter_num);
        Cy_TCPWM_TriggerReloadOrIndex_Single(TCPWM0, self->counter_num);
    }

    return mp_obj_new_int_from_ll(result);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_value_obj, 1, 2, machine_counter_value);

// ---------------------------------------------------------------------------
// counter.cycles([value])
// ---------------------------------------------------------------------------
// Get or set the signed 16-bit software cycles counter.
static mp_obj_t machine_counter_cycles(size_t n_args, const mp_obj_t *args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

    // set cycles value if provided and also returning previous value.
    if (n_args == 2) {
        mp_int_t value = mp_obj_get_int(args[1]);
        if (value < -32768 || value > 32767) {
            mp_raise_ValueError(MP_ERROR_TEXT("cycles out of range"));
        }
        mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
        int16_t prev = machine_counter_cycles_get(self);
        self->cycles_u16 = (uint16_t)(int16_t)value;
        MICROPY_END_ATOMIC_SECTION(irq_state);
        return mp_obj_new_int(prev);
    }

    // Return current cycles value when no argument is provided.
    mp_uint_t irq_state = MICROPY_BEGIN_ATOMIC_SECTION();
    int16_t prev = machine_counter_cycles_get(self);
    MICROPY_END_ATOMIC_SECTION(irq_state);

    return mp_obj_new_int(prev);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_counter_cycles_obj, 1, 2, machine_counter_cycles);

// ---------------------------------------------------------------------------
// counter.irq(handler=None, trigger=0, hard=False)
// ---------------------------------------------------------------------------
// Return or configure a Counter IRQ object for this counter.
static mp_obj_t machine_counter_irq(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_counter_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    bool any_args = n_args > 1 || kw_args->used != 0;

    if (!self->configured) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("not initialised"));
    }

